* About

This is the *new* website of the BINSEC tool.

It is now automatically generated by the [[https://jekyllrb.com/docs/installation/][Jekyll]] static website generator.




* Contributing
  :PROPERTIES:
  :dir:      /home/richard/devel/binsec/www/jekyll
  :END:

1. Install  Jekyll (see [[https://jekyllrb.com/docs/installation/][Installation instructions]]).
2. Write a new post under the ~_posts~ directory.
3. Check by running ~jekyll serve &~ (or ~bundle exec jekyll build~ if
   you have [[https://bundler.io/][Bundler]] installed), and pointing your browser to ~localhost:4000~:

   #+begin_src shell :var BROWSER="firefox"
   $BROWSER localhost:4000
   #+end_src

   #+RESULTS:
   : Created new window in existing browser session.

   Check that your post appears and looks like you intended.
   If not, go back to the previous step.

4. Commit once you're satisfied by adding and pushing your post to the git
   repository.
